# <CENTER>Code for web scraping and getting the required data from the webpages and saving it to MySQL</CENTER>
<hr>

### Importing libraries

In [1]:
import requests
import time
from bs4 import BeautifulSoup
import re
import pandas as pd
from sqlalchemy import create_engine
import pymysql
import warnings
import mysql.connector

### Jobs to be scarped list

We have used "Data+Sc", "Data+Ana", "Business+Ana" becasue they encompass all the required positions such as 'Data Scientist', 'Data Scientist 1', 'Data Scientist Ii', for "Data+Sc".

In [2]:
job_titles = ("Data+Sc", "Data+Ana", "Business+Ana")

### Years to be scraped list

In [3]:
year_list = ("2019", "2018", "2017", "2016", "2015")

### Loop to download the required pages for 5 years and 3 job titles

In [4]:
for title in job_titles :
    
    for year in year_list :
        print(title+", "+year)
    
    ## Setting the url code to save for the title and the year
        url = "https://h1bdata.info/index.php?em=&job="+title+"&city=&year="+year

        source = requests.get(url, headers = {'user-agent':'Mozilla/5.0'})
        file_name = title+"_"+year+".htm"
        save_file = open(file_name, "wb")
        save_file.write(source.content)
        save_file.close()

        print("Search page :"+url+"\nSaved as file: "+file_name+"\n\n")

        ## The for loop pauses or sleeps for 10 seconds to mimic human interaction with the website
        time.sleep(10)

Data+Sc, 2019
Search page :https://h1bdata.info/index.php?em=&job=Data+Sc&city=&year=2019
Saved as file: Data+Sc_2019.htm


Data+Sc, 2018
Search page :https://h1bdata.info/index.php?em=&job=Data+Sc&city=&year=2018
Saved as file: Data+Sc_2018.htm


Data+Sc, 2017
Search page :https://h1bdata.info/index.php?em=&job=Data+Sc&city=&year=2017
Saved as file: Data+Sc_2017.htm


Data+Sc, 2016
Search page :https://h1bdata.info/index.php?em=&job=Data+Sc&city=&year=2016
Saved as file: Data+Sc_2016.htm


Data+Sc, 2015
Search page :https://h1bdata.info/index.php?em=&job=Data+Sc&city=&year=2015
Saved as file: Data+Sc_2015.htm


Data+Ana, 2019
Search page :https://h1bdata.info/index.php?em=&job=Data+Ana&city=&year=2019
Saved as file: Data+Ana_2019.htm


Data+Ana, 2018
Search page :https://h1bdata.info/index.php?em=&job=Data+Ana&city=&year=2018
Saved as file: Data+Ana_2018.htm


Data+Ana, 2017
Search page :https://h1bdata.info/index.php?em=&job=Data+Ana&city=&year=2017
Saved as file: Data+Ana_2017.htm


Data+Ana, 2016
Search page :https://h1bdata.info/index.php?em=&job=Data+Ana&city=&year=2016
Saved as file: Data+Ana_2016.htm


Data+Ana, 2015
Search page :https://h1bdata.info/index.php?em=&job=Data+Ana&city=&year=2015
Saved as file: Data+Ana_2015.htm


Business+Ana, 2019
Search page :https://h1bdata.info/index.php?em=&job=Business+Ana&city=&year=2019
Saved as file: Business+Ana_2019.htm


Business+Ana, 2018
Search page :https://h1bdata.info/index.php?em=&job=Business+Ana&city=&year=2018
Saved as file: Business+Ana_2018.htm


Business+Ana, 2017
Search page :https://h1bdata.info/index.php?em=&job=Business+Ana&city=&year=2017
Saved as file: Business+Ana_2017.htm


Business+Ana, 2016
Search page :https://h1bdata.info/index.php?em=&job=Business+Ana&city=&year=2016
Saved as file: Business+Ana_2016.htm


Business+Ana, 2015
Search page :https://h1bdata.info/index.php?em=&job=Business+Ana&city=&year=2015
Saved as file: Business+Ana_2015.htm

## Code to read the table from the saved files and save it into a DataFrame.

In [11]:
## Creating an empty dataframe to which we will keep appending the data
table_data=pd.DataFrame()

In [12]:
for title in job_titles :
    
    for year in year_list :
        print("Adding "+title+", "+year+" to the Dataframe")
    
        file_name = title+"_"+year+".htm"
        
        ## Opening and reading the file
        html_file = open(file_name, "rb")
        
        ## Saving the tables of the HTML file into a list
        temp_table_list=pd.read_html(html_file)
        
        table_data = table_data.append(temp_table_list[0], ignore_index = True)
        
        print(title+", "+year+" added to the dataframe\n\n")

Adding Data+Sc, 2019 to the Dataframe
Data+Sc, 2019 added to the dataframe


Adding Data+Sc, 2018 to the Dataframe
Data+Sc, 2018 added to the dataframe


Adding Data+Sc, 2017 to the Dataframe
Data+Sc, 2017 added to the dataframe


Adding Data+Sc, 2016 to the Dataframe
Data+Sc, 2016 added to the dataframe


Adding Data+Sc, 2015 to the Dataframe
Data+Sc, 2015 added to the dataframe


Adding Data+Ana, 2019 to the Dataframe
Data+Ana, 2019 added to the dataframe


Adding Data+Ana, 2018 to the Dataframe
Data+Ana, 2018 added to the dataframe


Adding Data+Ana, 2017 to the Dataframe
Data+Ana, 2017 added to the dataframe


Adding Data+Ana, 2016 to the Dataframe
Data+Ana, 2016 added to the dataframe


Adding Data+Ana, 2015 to the Dataframe
Data+Ana, 2015 added to the dataframe


Adding Business+Ana, 2019 to the Dataframe
Business+Ana, 2019 added to the dataframe


Adding Business+Ana, 2018 to the Dataframe
Business+Ana, 2018 added to the dataframe


Adding Business+Ana, 2017 to the Dataframe
Business+Ana, 2017 added to the dataframe


Adding Business+Ana, 2016 to the Dataframe
Business+Ana, 2016 added to the dataframe


Adding Business+Ana, 2015 to the Dataframe
Business+Ana, 2015 added to the dataframe

In [13]:
table_data.head()

,EMPLOYER,JOB TITLE,BASE SALARY,LOCATION,SUBMIT DATE,START DATE,CASE STATUS
0,SEGMENTIO INC,DATA SCIENCE,170000,"SAN FRANCISCO, CA",04/23/2019,06/10/2019,CERTIFIED
1,BELK INC,DATA SCIENCE & FORECAST ANALYST,82000,"CHARLOTTE, NC",03/07/2019,09/03/2019,CERTIFIED
2,MICRON TECHNOLOGY INC,DATA SCIENCE & PROCESS CONTROLS ENGINEERING PR...,88230,"BOISE, ID",02/22/2019,08/22/2019,CERTIFIED
3,LIVE NATION WORLDWIDE INC,DATA SCIENCE - SENIOR ENGINEER,124738,"HOLLYWOOD, CA",08/09/2019,09/04/2019,CERTIFIED
4,FEDEX CUSTOM CRITICAL INC,DATA SCIENCE ADVISOR,87000,"UNIONTOWN, OH",03/13/2019,09/11/2019,CERTIFIED

In [14]:
len(table_data)

56038

In [15]:
table_data.dtypes

EMPLOYER       object
JOB TITLE      object
BASE SALARY     int64
LOCATION       object
SUBMIT DATE    object
START DATE     object
CASE STATUS    object
dtype: object

In [16]:
table_data.tail()

,EMPLOYER,JOB TITLE,BASE SALARY,LOCATION,SUBMIT DATE,START DATE,CASE STATUS
56033,PHOTON INFOTECH INC,BUSINESS ANAYLST,61714,"WHIPPANY, NJ",03/20/2015,09/01/2015,CERTIFIED
56034,DELOITTE CONSULTING LLP,BUSINESS ANAYLST,72000,"WESTON, MA",02/19/2015,08/20/2015,CERTIFIED
56035,IBM INDIA PRIVATE LIMITED,BUSINESS ANAYLST,75504,"PORTLAND, OR",02/19/2015,08/19/2015,CERTIFIED
56036,IBM INDIA PRIVATE LIMITED,BUSINESS ANAYLST,75504,"PORTLAND, OR",02/24/2015,08/24/2015,CERTIFIED
56037,IBM INDIA PVT LTD,BUSINESS ANAYLST,75504,"PORTLAND, OR",03/04/2015,09/03/2015,CERTIFIED

In [17]:
table_data.describe

<bound method NDFrame.describe of                         EMPLOYER  \
0                  SEGMENTIO INC
1                       BELK INC
2          MICRON TECHNOLOGY INC
3      LIVE NATION WORLDWIDE INC
4      FEDEX CUSTOM CRITICAL INC
...                          ...
56033        PHOTON INFOTECH INC
56034    DELOITTE CONSULTING LLP
56035  IBM INDIA PRIVATE LIMITED
56036  IBM INDIA PRIVATE LIMITED
56037          IBM INDIA PVT LTD

                                               JOB TITLE  BASE SALARY  \
0                                           DATA SCIENCE       170000
1                        DATA SCIENCE & FORECAST ANALYST        82000
2      DATA SCIENCE & PROCESS CONTROLS ENGINEERING PR...        88230
3                         DATA SCIENCE - SENIOR ENGINEER       124738
4                                   DATA SCIENCE ADVISOR        87000
...                                                  ...          ...
56033                                   BUSINESS ANAYLST        61714
56034                                   BUSINESS ANAYLST        72000
56035                                   BUSINESS ANAYLST        75504
56036                                   BUSINESS ANAYLST        75504
56037                                   BUSINESS ANAYLST        75504

                LOCATION SUBMIT DATE  START DATE CASE STATUS
0      SAN FRANCISCO, CA  04/23/2019  06/10/2019   CERTIFIED
1          CHARLOTTE, NC  03/07/2019  09/03/2019   CERTIFIED
2              BOISE, ID  02/22/2019  08/22/2019   CERTIFIED
3          HOLLYWOOD, CA  08/09/2019  09/04/2019   CERTIFIED
4          UNIONTOWN, OH  03/13/2019  09/11/2019   CERTIFIED
...                  ...         ...         ...         ...
56033       WHIPPANY, NJ  03/20/2015  09/01/2015   CERTIFIED
56034         WESTON, MA  02/19/2015  08/20/2015   CERTIFIED
56035       PORTLAND, OR  02/19/2015  08/19/2015   CERTIFIED
56036       PORTLAND, OR  02/24/2015  08/24/2015   CERTIFIED
56037       PORTLAND, OR  03/04/2015  09/03/2015   CERTIFIED

[56038 rows x 7 columns]>

In [18]:
table_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56038 entries, 0 to 56037
Data columns (total 7 columns):
EMPLOYER       56037 non-null object
JOB TITLE      56038 non-null object
BASE SALARY    56038 non-null int64
LOCATION       56038 non-null object
SUBMIT DATE    56038 non-null object
START DATE     56038 non-null object
CASE STATUS    56038 non-null object
dtypes: int64(1), object(6)
memory usage: 3.0+ MB

In [28]:
table_data.loc[table_data["EMPLOYER"] == None]

Empty DataFrame
Columns: [EMPLOYER, JOB TITLE, BASE SALARY, LOCATION, SUBMIT DATE, START DATE, CASE STATUS]
Index: []

## Writing the Dataframe to Excel file - h1bdata.xlsx

In [29]:
writer = pd.ExcelWriter('h1bdata.xlsx')
table_data.to_excel(writer)
writer.save()
print('DataFrame is written successfully to Excel File.')

DataFrame is written successfully to Excel File.

### Code to read excel and then push it to MySQL

#### Make changes to the password and username here in this code to push it to Excel

In [2]:
h1b_data = pd.read_excel('h1bdata.xlsx')

In [4]:
h1b_data.head()

,Sr.No.,EMPLOYER,JOB TITLE,BASE SALARY,LOCATION,SUBMIT DATE,START DATE,CASE STATUS
0,1,SEGMENTIO INC,DATA SCIENCE,170000,"SAN FRANCISCO, CA",04/23/2019,06/10/2019,CERTIFIED
1,2,BELK INC,DATA SCIENCE & FORECAST ANALYST,82000,"CHARLOTTE, NC",03/07/2019,09/03/2019,CERTIFIED
2,3,MICRON TECHNOLOGY INC,DATA SCIENCE & PROCESS CONTROLS ENGINEERING PR...,88230,"BOISE, ID",02/22/2019,08/22/2019,CERTIFIED
3,4,LIVE NATION WORLDWIDE INC,DATA SCIENCE - SENIOR ENGINEER,124738,"HOLLYWOOD, CA",08/09/2019,09/04/2019,CERTIFIED
4,5,FEDEX CUSTOM CRITICAL INC,DATA SCIENCE ADVISOR,87000,"UNIONTOWN, OH",03/13/2019,09/11/2019,CERTIFIED

In [6]:
h1b_data.drop(['Sr.No.'], axis = 1, inplace = True)

In [7]:
h1b_data.head()

,EMPLOYER,JOB TITLE,BASE SALARY,LOCATION,SUBMIT DATE,START DATE,CASE STATUS
0,SEGMENTIO INC,DATA SCIENCE,170000,"SAN FRANCISCO, CA",04/23/2019,06/10/2019,CERTIFIED
1,BELK INC,DATA SCIENCE & FORECAST ANALYST,82000,"CHARLOTTE, NC",03/07/2019,09/03/2019,CERTIFIED
2,MICRON TECHNOLOGY INC,DATA SCIENCE & PROCESS CONTROLS ENGINEERING PR...,88230,"BOISE, ID",02/22/2019,08/22/2019,CERTIFIED
3,LIVE NATION WORLDWIDE INC,DATA SCIENCE - SENIOR ENGINEER,124738,"HOLLYWOOD, CA",08/09/2019,09/04/2019,CERTIFIED
4,FEDEX CUSTOM CRITICAL INC,DATA SCIENCE ADVISOR,87000,"UNIONTOWN, OH",03/13/2019,09/11/2019,CERTIFIED

In [8]:
h1b_data['SUBMIT DATE'] = pd.to_datetime(h1b_data['SUBMIT DATE'])

In [9]:
h1b_data['START DATE'] = pd.to_datetime(h1b_data['START DATE'])

In [10]:
h1b_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56038 entries, 0 to 56037
Data columns (total 7 columns):
EMPLOYER       56037 non-null object
JOB TITLE      56038 non-null object
BASE SALARY    56038 non-null int64
LOCATION       56038 non-null object
SUBMIT DATE    56038 non-null datetime64[ns]
START DATE     56038 non-null datetime64[ns]
CASE STATUS    56038 non-null object
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 3.0+ MB

In [11]:
h1b_data.head()

,EMPLOYER,JOB TITLE,BASE SALARY,LOCATION,SUBMIT DATE,START DATE,CASE STATUS
0,SEGMENTIO INC,DATA SCIENCE,170000,"SAN FRANCISCO, CA",2019-04-23,2019-06-10,CERTIFIED
1,BELK INC,DATA SCIENCE & FORECAST ANALYST,82000,"CHARLOTTE, NC",2019-03-07,2019-09-03,CERTIFIED
2,MICRON TECHNOLOGY INC,DATA SCIENCE & PROCESS CONTROLS ENGINEERING PR...,88230,"BOISE, ID",2019-02-22,2019-08-22,CERTIFIED
3,LIVE NATION WORLDWIDE INC,DATA SCIENCE - SENIOR ENGINEER,124738,"HOLLYWOOD, CA",2019-08-09,2019-09-04,CERTIFIED
4,FEDEX CUSTOM CRITICAL INC,DATA SCIENCE ADVISOR,87000,"UNIONTOWN, OH",2019-03-13,2019-09-11,CERTIFIED

### Creating a connection to MySQL and creating a database called "h1b_SQL"

In [21]:
mydb = mysql.connector.connect(
    host="localhost",
    user="",
    passwd=""
)

mycursor = mydb.cursor()

mycursor.execute("CREATE DATABASE IF NOT EXISTS h1b_sql")

mycursor.close()

mydb.close

### Creating a connection to MySQL and creating a table called "h1b_data"

In [22]:
mydb = mysql.connector.connect(
    host="localhost",
    user="",
    passwd="",
    database="h1b_sql"
)

mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE IF NOT EXISTS h1b_data (DataID int NOT NULL AUTO_INCREMENT PRIMARY KEY , EMPLOYER VARCHAR(50), JOB_TITLE VARCHAR(100), BASE_SALARY BIGINT, LOCATION VARCHAR(100), SUBMIT_DATE DATE, START_DATE DATE,CASE_STATUS VARCHAR(30));")

mycursor.close()

mydb.close

In [23]:
engine = create_engine('mysql+pymysql://root:My1234SQL!@#$@localhost/h1b_sql')

In [24]:
dbConnection = engine.connect()

In [25]:
h1b_data.to_sql('h1b_data', dbConnection, index = True, if_exists='replace')

In [26]:
results = pd.read_sql("select * from h1b_data", dbConnection);

In [27]:
pd.set_option('display.expand_frame_repr', False)
dbConnection.close()

In [28]:
results.head()

   index                   EMPLOYER                                          JOB TITLE  BASE SALARY           LOCATION SUBMIT DATE START DATE CASE STATUS
0      0              SEGMENTIO INC                                       DATA SCIENCE       170000  SAN FRANCISCO, CA  2019-04-23 2019-06-10   CERTIFIED
1      1                   BELK INC                    DATA SCIENCE & FORECAST ANALYST        82000      CHARLOTTE, NC  2019-03-07 2019-09-03   CERTIFIED
2      2      MICRON TECHNOLOGY INC  DATA SCIENCE & PROCESS CONTROLS ENGINEERING PR...        88230          BOISE, ID  2019-02-22 2019-08-22   CERTIFIED
3      3  LIVE NATION WORLDWIDE INC                     DATA SCIENCE - SENIOR ENGINEER       124738      HOLLYWOOD, CA  2019-08-09 2019-09-04   CERTIFIED
4      4  FEDEX CUSTOM CRITICAL INC                               DATA SCIENCE ADVISOR        87000      UNIONTOWN, OH  2019-03-13 2019-09-11   CERTIFIED